# -*- coding: utf-8 -*-

latin=[
       '0','1','2','3','4','5','6','7','8','9',' ','*','!','@','#','$','%',':','&','(',')','-','+','.',',','I','_','–','"',
       'a','b','c','ç','d','e','ə','f','g','ğ','h','x','ı','i','j','k','q','l','m','n','o','ö','p','r','s','ş','t','u','ü','v','y','z',
       'A','B','C','Ç','D','E','Ə','F','G','H','X','İ','J','K','Q','L','M','N','O','Ö','P','R','S','Ş','T','U','Ü','V','Y','Z'
      ]

kiril=[
        '0','1','2','3','4','5','6','7','8','9',' ','*','!','@','#','$','%',':','&','(',')','-','+','.',',','I','_','–','"',
        'а','б','ҹ','ч','д','e','ә','ф','ҝ','ғ','һ','х','ы','и','ж','к','г','л','м','н','о','ө','п','р','с','ш','т','у','ү','в','ј','з',
        'А','Б','Ҹ','Ч','Д','Е','Ә','Ф','Ҝ','Һ','X','И','Ж','К','Г','Л','М','Н','О','Ө','П','Р','С','Ш','Т','У','Ү','В','Ј','З'
       ]

while True:

    mod=str(input('Latin To Kiril(L/K), Kiril To Latin(K/L)'))

    text=str(input('Metni daxil edin: '))

    text=list(text)

    if mod=='K/L':
        
        for i in text:

            index=kiril.index(i)

            print(latin[index],end='')

        print('\n')

    if mod=='L/K':

        for i in text:

            index=latin.index(i)

            print(kiril[index],end='')

        print('\n')
        
    
